interThermalPhaseFoam/BubblySGS/BubblySGS_NewTest2/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    BotWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       19800;
    }
    FreeStream
    {
        type            patch;
        nFaces          100;
        startFace       19900;
    }
    FrontNBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          20000;
        startFace       20000;
    }
    LeftSide
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          100;
        startFace       40000;
    }
    RightSide
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          100;
        startFace       40100;
    }
)

// ************************************************************************* //
