interThermalPhaseFoam/BubblySGS/BubblySGS_NewTest2/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.X                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


defaultFieldValues
(
	volScalarFieldValue beta 0
);

regions
(
	boxToCell
	{
		box (0  0  0) (0.02 0.01 0.0002);
		fieldValues
		(
			volScalarFieldValue beta 0.1
		);
	}
);



// *********************************************************************** //
